export const FormRu = {
  slogan: "Готовы обсудить ваш проект?",
  description: {
    beforeEmail: "Заполните форму справа или напишите на",
    afterEmail: "Мы свяжемся с вами прямо сейчас!",
  },
  fields: {
    commonErrors: {
      required: "Пожалуйста, заполните это поле",
    },
    name: {
      placeholder: "Имя",
      error: "Имя должно содержать больше 3 символов",
      requiredError: "Пожалуйста, введите ваше имя",
    },
    company: {
      placeholder: "Компания",
      error: "Название компании должно содержать больше 3 символов",
      requiredError: "Пожалуйста, введите название вашей компании",
    },
    phone: {
      placeholder: "Телефон",
      error: "Номер телефона должен содержать больше 6 символов",
      requiredError: "Пожалуйста, введите ваш номер телефона",
    },
    email: {
      placeholder: "Эл. почта",
      error: "Неверный email",
      requiredError: "Пожалуйста, введите адрес вашей почты",
    },
    describe: {
      placeholder: "Расскажите о проекте",
      requiredError: "Пожалуйста, введите описание вашего проекта",
    },
  },
  contacts: {
    label: "Предпочтительный способ связи",
    phone: "Телефон",
    email: "Эл. почта",
  },
  attachment: {
    label: "Прикрепить файл",
    sub: "Максимальный размер файла 24 МБ",
    errors: {
      tooLarge: "Размер файла не может превышать 24 МБ!",
    },
  },
  send: "Отправить",
  agreement:
    "Нажимая на кнопку, вы даете согласие на обработку персональных данных и соглашаетесь с политикой конфиденциальности.",
  submitMessage:
    "Спасибо за оставленную заявку! <br> Наш менеджер свяжется с вами в ближайшее время!",
};
